openocd-org/openocd/src/flash/nor/max32xxx.c
	// Lock flash
	target_read_u32(target, info->flc_base + FLC_CN, &flash_cn);
	flash_cn &= ~(FLC_CN_UNLOCK_MASK);
	target_write_u32(target, info->flc_base + FLC_CN, flash_cn);
	return ERROR_OK;
}

static int max32xxx_protect_check(struct flash_bank *bank)
{
	struct max32xxx_flash_bank *info = bank->driver_priv;
	struct target *target = bank->target;
	uint32_t temp_reg;

	if (!info->probed)
		return ERROR_FLASH_BANK_NOT_PROBED;

	if (!info->max326xx) {
		for (unsigned int i = 0; i < bank->num_sectors; i++)
			bank->sectors[i].is_protected = -1;

		return ERROR_FLASH_OPER_UNSUPPORTED;
	}

	// Check the protection
	for (unsigned int i = 0; i < bank->num_sectors; i++) {
		if (i % 32 == 0)
			target_read_u32(target, info->flc_base + FLC_PROT + ((i / 32) * 4), &temp_reg);

		if (temp_reg & (0x1 << i % 32))
			bank->sectors[i].is_protected = 1;
		else
			bank->sectors[i].is_protected = 0;
	}
	return ERROR_OK;
}

static int max32xxx_erase(struct flash_bank *bank, unsigned int first,
	unsigned int last)
{
	uint32_t flash_cn, flash_int;
	struct max32xxx_flash_bank *info = bank->driver_priv;
	struct target *target = bank->target;
	int retval;
	int retry;

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (!info->probed)
		return ERROR_FLASH_BANK_NOT_PROBED;

	if (last < first || last >= bank->num_sectors)
		return ERROR_FLASH_SECTOR_INVALID;

	if (first == 0 && last == (bank->num_sectors - 1))
		return max32xxx_mass_erase(bank);

	// Prepare to issue flash operation
	retval = max32xxx_flash_op_pre(bank);

	if (retval != ERROR_OK)
		return retval;

	int erased = 0;
	for (unsigned int banknr = first; banknr <= last; banknr++) {
		// Check the protection
		if (bank->sectors[banknr].is_protected == 1) {
			LOG_WARNING("Flash sector %u is protected", banknr);
			continue;
		} else {
			erased = 1;
		}

		// Address is first word in page
		target_write_u32(target, info->flc_base + FLC_ADDR, banknr * info->sector_size);

		// Write page erase code
		target_read_u32(target, info->flc_base + FLC_CN, &flash_cn);
		flash_cn |= FLC_CN_ERASE_CODE_PGE;
		target_write_u32(target, info->flc_base + FLC_CN, flash_cn);

		// Issue page erase command
		flash_cn |= FLC_CN_PGE;
		target_write_u32(target, info->flc_base + FLC_CN, flash_cn);

		// Wait until erase complete
		retry = 1000;
		do {
			target_read_u32(target, info->flc_base + FLC_CN, &flash_cn);
		} while ((--retry > 0) && max32xxx_flash_busy(flash_cn));

		if (retry <= 0) {
			LOG_ERROR("Timed out waiting for flash page erase @ 0x%08" PRIx32,
				(banknr * info->sector_size));
			return ERROR_FLASH_OPERATION_FAILED;
		}

		// Check access violations
		target_read_u32(target, info->flc_base + FLC_INT, &flash_int);
		if (flash_int & FLC_INT_AF) {
			LOG_ERROR("Error erasing flash page %i", banknr);
			target_write_u32(target, info->flc_base + FLC_INT, 0);
			max32xxx_flash_op_post(bank);
			return ERROR_FLASH_OPERATION_FAILED;
		}
	}

	if (!erased) {
		LOG_ERROR("All pages protected %u to %u", first, last);
		max32xxx_flash_op_post(bank);
		return ERROR_FAIL;
	}

	if (max32xxx_flash_op_post(bank) != ERROR_OK)
		return ERROR_FAIL;

	return ERROR_OK;
}

static int max32xxx_protect(struct flash_bank *bank, int set,
	unsigned int first, unsigned int last)
{
	struct max32xxx_flash_bank *info = bank->driver_priv;
	struct target *target = bank->target;
	uint32_t temp_reg;

	if (bank->target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	if (!info->probed)
		return ERROR_FLASH_BANK_NOT_PROBED;

	if (!info->max326xx)
		return ERROR_FLASH_OPER_UNSUPPORTED;

	if (last < first || last >= bank->num_sectors)
		return ERROR_FLASH_SECTOR_INVALID;

	// Setup the protection on the pages given
	for (unsigned int page = first; page <= last; page++) {
		if (set) {
			// Set the write/erase bit for this page
			target_read_u32(target, info->flc_base + FLC_PROT + (page / 32), &temp_reg);
			temp_reg |= (0x1 << page % 32);
			target_write_u32(target, info->flc_base + FLC_PROT + (page / 32), temp_reg);
			bank->sectors[page].is_protected = 1;
		} else {
			// Clear the write/erase bit for this page
			target_read_u32(target, info->flc_base + FLC_PROT + (page / 32), &temp_reg);
			temp_reg &= ~(0x1 << page % 32);
			target_write_u32(target, info->flc_base + FLC_PROT + (page / 32), temp_reg);
			bank->sectors[page].is_protected = 0;
		}
	}

	return ERROR_OK;
}

static int max32xxx_write_block(struct flash_bank *bank, const uint8_t *buffer,
	uint32_t offset, uint32_t len)
{
	struct max32xxx_flash_bank *info = bank->driver_priv;
	struct target *target = bank->target;
	const char *target_type_name = (const char *)target->type->name;
	uint32_t buffer_size = 16384;
	struct working_area *source;
	struct working_area *write_algorithm;
	struct reg_param reg_params[5];
	struct mem_param mem_param[2];
	struct armv7m_algorithm armv7m_info;
	int retval = ERROR_OK;
	// power of two, and multiple of word size
	static const unsigned int buf_min = 128;
	uint8_t *write_code;
	int write_code_size;


	if (strcmp(target_type_name, "cortex_m") == 0) {
		write_code = (uint8_t *)write_code_arm;
		write_code_size = sizeof(write_code_arm);
	} else {
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	LOG_DEBUG("bank=%p buffer=%p offset=%08" PRIx32 " len=%08" PRIx32 "",
		bank, buffer, offset, len);

	// flash write code
	if (target_alloc_working_area(target, write_code_size, &write_algorithm) != ERROR_OK) {
		LOG_DEBUG("no working area for block memory writes");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	// memory buffer
	while (target_alloc_working_area_try(target, buffer_size, &source) != ERROR_OK) {
		buffer_size /= 2;

		if (buffer_size <= buf_min) {
			target_free_working_area(target, write_algorithm);
			return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
		}

		LOG_DEBUG("retry target_alloc_working_area(%s, size=%" PRIu32 ")",
			target_name(target), buffer_size);
	}

	target_write_buffer(target, write_algorithm->address, write_code_size,
		write_code);

	armv7m_info.common_magic = ARMV7M_COMMON_MAGIC;
	armv7m_info.core_mode = ARM_MODE_THREAD;

	// TODO: a0-a3 for RISCV

	if (strcmp(target_type_name, "cortex_m") == 0) {
		init_reg_param(&reg_params[0], "r0", 32, PARAM_OUT);
		init_reg_param(&reg_params[1], "r1", 32, PARAM_OUT);
		init_reg_param(&reg_params[2], "r2", 32, PARAM_OUT);
		init_reg_param(&reg_params[3], "r3", 32, PARAM_OUT);
	} else {
		init_reg_param(&reg_params[0], "a0", 32, PARAM_OUT);
		init_reg_param(&reg_params[1], "a1", 32, PARAM_OUT);
		init_reg_param(&reg_params[2], "a2", 32, PARAM_OUT);
		init_reg_param(&reg_params[3], "a3", 32, PARAM_OUT);
	}
	init_reg_param(&reg_params[4], "sp", 32, PARAM_OUT);

	buf_set_u32(reg_params[0].value, 0, 32, source->address);
	buf_set_u32(reg_params[1].value, 0, 32, source->address + source->size);
	buf_set_u32(reg_params[2].value, 0, 32, len);
	buf_set_u32(reg_params[3].value, 0, 32, offset);
	buf_set_u32(reg_params[4].value, 0, 32, source->address + source->size);

	// mem_params for options
	init_mem_param(&mem_param[0], source->address + (source->size - 8 - 128), 4, PARAM_OUT);
	init_mem_param(&mem_param[1], source->address + (source->size - 4 - 128), 4, PARAM_OUT);
	buf_set_u32(mem_param[0].value, 0, 32, info->options);
	buf_set_u32(mem_param[1].value, 0, 32, info->flc_base);

